{"id": "enwiki-00000000-0000-0000", "contents": "! (Cláudia Pascoal album)\n! (pronounced \"blah\") is the debut studio album by Portuguese singer Cláudia Pascoal. It was released in Portugal on 27 March 2020 by Universal Music Portugal. The album peaked at number six on the Portuguese Albums Chart.", "metadata": {"title_span": [0, 25], "section_span": [25, 25], "content_span": [26, 248]}, "doc_id": "enwiki-00000000-0000-0000"}
{"id": "enwiki-00000001-0000-0000", "contents": "! (The Dismemberment Plan album)\n! is the debut studio album by American indie rock band The Dismemberment Plan. It was released on October 2, 1995 on DeSoto Records. The band's original drummer Steve Cummings played on the album but left shortly after its release.", "metadata": {"title_span": [0, 32], "section_span": [32, 32], "content_span": [33, 265]}, "doc_id": "enwiki-00000001-0000-0000"}
{"id": "enwiki-00000001-0001-0000", "contents": "! (The Dismemberment Plan album), Personnel\nThe following people were involved in the making of ! :", "metadata": {"title_span": [0, 32], "section_span": [34, 43], "content_span": [44, 99]}, "doc_id": "enwiki-00000001-0001-0000"}
{"id": "enwiki-00000002-0000-0000", "contents": "! (The Song Formerly Known As)\n\"! (The Song Formerly Known As)\" is a song by Australian rock band Regurgitator. The song was released as a double-A sided single with \"Modern Life\" in September 1998 as the fourth and final single from the band's second studio album Unit. The single peaked at number 28 in Australia and it also ranked at number 6 on Triple J's Hottest 100 in 1998, with the single's bonus track \"I Like Your Old Remix Better Than Your New Remix\" being ranked at number 27.", "metadata": {"title_span": [0, 30], "section_span": [30, 30], "content_span": [31, 488]}, "doc_id": "enwiki-00000002-0000-0000"}
{"id": "enwiki-00000002-0001-0000", "contents": "! (The Song Formerly Known As)\nAt the ARIA Music Awards of 1999, the song was nominated for two awards; ARIA Award for Best Group and ARIA Award for Single of the Year.", "metadata": {"title_span": [0, 30], "section_span": [30, 30], "content_span": [31, 168]}, "doc_id": "enwiki-00000002-0001-0000"}
{"id": "enwiki-00000002-0002-0000", "contents": "! (The Song Formerly Known As), Critical reception\nIn 2014, Clem Bastow from The Guardian said \"'!' is unmatched: it's a towering slab of electronic fuzz, tailor made for giant stadiums and the sort of raves that bring to mind The Matrix's Zion scenes, and yet the song is about staying home and listening to records in the living room with your significant other.\"", "metadata": {"title_span": [0, 30], "section_span": [32, 50], "content_span": [51, 365]}, "doc_id": "enwiki-00000002-0002-0000"}
{"id": "enwiki-00000002-0003-0000", "contents": "! (The Song Formerly Known As), Critical reception\nIn 2015, the song was listed at number 60 in In the Mix's 100 Greatest Australian Dance Tracks of All Time with Nick Jarvis saying \"The best track on the album (and arguably the best track the 'Gurge has written yet) – a dance track played by a live band about how dancing around your living room with bae wearing ugly pants is so much better than going out to loud, smoky clubs. \".", "metadata": {"title_span": [0, 30], "section_span": [32, 50], "content_span": [51, 433]}, "doc_id": "enwiki-00000002-0003-0000"}
{"id": "enwiki-00000002-0004-0000", "contents": "! (The Song Formerly Known As), Critical reception\nIn 2019, Tyler Jenke from The Brag ranked Regurgitator's best songs, with \"!\" coming it at number 1. Jenke said \"Ask anyone from the era, and they'll all agree that '! (The Song Formerly Known As)' is Regurgitator's finest moment.. it managed to become their shining glory, with lyrics that describe just sitting back and avoiding clubs, raves, and concerts in favor of a comfy lounge room in suburbia.\" calling the song \"an essential piece of Aussie music history.\"", "metadata": {"title_span": [0, 30], "section_span": [32, 50], "content_span": [51, 517]}, "doc_id": "enwiki-00000002-0004-0000"}
{"id": "enwiki-00000002-0005-0000", "contents": "! (The Song Formerly Known As), Critical reception\nJunkee said, \"Even at their most ribald, they still sound like an out-of-control after-school care group going to town on a bunch of poor, unsuspecting instruments. \"!\" isn’t even really a song. It’s a work of punkish extravagance, dressed in nothing but a streak of yellow paint and with murder on its mind. \"", "metadata": {"title_span": [0, 30], "section_span": [32, 50], "content_span": [51, 361]}, "doc_id": "enwiki-00000002-0005-0000"}
{"id": "enwiki-00000003-0000-0000", "contents": "! (Trippie Redd album)\n! (pronounced \"Exclamation Mark\") is the second studio album by American rapper Trippie Redd. It was released on August 9, 2019, by TenThousand Projects and Caroline Records. The album features appearances from Diplo, The Game, Lil Duke, Lil Baby and Coi Leray. The album also originally featured Playboi Carti, but was later removed from the album.", "metadata": {"title_span": [0, 22], "section_span": [22, 22], "content_span": [23, 372]}, "doc_id": "enwiki-00000003-0000-0000"}
{"id": "enwiki-00000003-0001-0000", "contents": "! (Trippie Redd album), Background\nIn January 2019, Trippie Redd announced that he had two more projects to be released soon in an Instagram live stream, his second studio album, Immortal and Mobile Suit Pussy, which was reportedly set to be his fourth commercial mixtape, but it then became scrapped. He explained that Immortal would have tracks where deep and romantic concepts are present, while Mobile Suit Pussy would have contained tracks that are \"bangers\". Later in March 2019 in another Instagram live stream, Redd stated that his second album had \"shifted and changed\" and was no longer titled Immortal. He later revealed that the album would be titled !, and inspired by former collaborator XXXTentacion's ? album.", "metadata": {"title_span": [0, 22], "section_span": [24, 34], "content_span": [35, 725]}, "doc_id": "enwiki-00000003-0001-0000"}
{"id": "enwiki-00000003-0002-0000", "contents": "! (Trippie Redd album), Background\nTrippie released the lead single to the album \"Under Enemy Arms\" on May 29, 2019. He confirmed in an interview with Zane Lowe of Beats 1 Radio that the album would be titled ! and was already completed, but that he wanted to add several more features as well as videos.", "metadata": {"title_span": [0, 22], "section_span": [24, 34], "content_span": [35, 304]}, "doc_id": "enwiki-00000003-0002-0000"}
{"id": "enwiki-00000003-0003-0000", "contents": "! (Trippie Redd album), Critical reception\n! was met with mixed reviews. At Metacritic, which assigns a normalized rating out of 100 to reviews from professional publications, the album received an average score of 59, which indicates \"mixed or average reviews\", based on 6 reviews.", "metadata": {"title_span": [0, 22], "section_span": [24, 42], "content_span": [43, 282]}, "doc_id": "enwiki-00000003-0003-0000"}
{"id": "enwiki-00000003-0004-0000", "contents": "! (Trippie Redd album), Critical reception\nRachel Aroesti of The Guardian described the album as \"compelling but contradictory emo-rap\", noting lyrical contradictions and concluding it \"is doubtless part of the genre's forward march – but it's hard to get past the sense that White has sacrificed a coherent artistic identity in the name of progress.\"", "metadata": {"title_span": [0, 22], "section_span": [24, 42], "content_span": [43, 351]}, "doc_id": "enwiki-00000003-0004-0000"}
{"id": "enwiki-00000003-0004-0001", "contents": "! (Trippie Redd album), Critical reception\nWriting for Pitchfork, Andy O'Connor wrote that the \"songs touch on being true to oneself at all costs, but these half-baked lessons land flat since Redd himself doesn't really have an identity, musical or otherwise\", further commenting, \"Most of what happens here couldn't even realistically be considered rapping\", calling the verses \"dull and unimaginative on top of being restrictive in form\" and \"nonsense bars\". O'Connor concluded that \"the most enjoyable moments feel like controlled chaos. Redd [...] does at least sound more composed. That's to his credit as a person but it's not to his advantage as an artist.\"", "metadata": {"title_span": [0, 22], "section_span": [24, 42], "content_span": [43, 664]}, "doc_id": "enwiki-00000003-0004-0001"}
