{"id":"enwiki-00000012-0007-0000","contents":"!PAUS3, Collaborations, The Daisy Kids\nWith legal issues resolved, November 20, 2015, saw the release of the Mr Conrad Samsung EP, which had been delayed since 2013 and is the final released recording featuring guitarist and vocalist Scott Putesky prior to his passing in 2017.","metadata":{"title_span":[0,6],"section_span":[8,38],"content_span":[39,277]}}
{"id":"enwiki-00000012-0008-0000","contents":"!PAUS3, Collaborations, Mr Conrad Samsung EP\nAfter numerous delays due to internal health problems plaguing both band members[5] Daisy Berkowitz and THEE PAUSE, the Mr Conrad Samsung EP was released digitally on September 20, 2015, via Organic Intelligence Records internationally. Vocal duties were split on this EP between Daisy Berkowitz, THEE PAUSE and Justin Symbol. No tour was planned at the time as the band members focused on their health, and Justin Symbol continued to pursue his various solo and side projects.","metadata":{"title_span":[0,6],"section_span":[8,44],"content_span":[45,522]}}
{"id":"enwiki-00000012-0009-0000","contents":"!PAUS3, Collaborations, Andy Stott's Numb (beauty of being) Remix\nAndy Stott is a Manchester-based producer of dub and techno music who has released three albums with the Modern Love label. THEE PAUSE's remix of Andy Stott's \"Numb\" charted on Pitchfork's Top 200 Tracks of the Decade so Far.","metadata":{"title_span":[0,6],"section_span":[8,65],"content_span":[66,291]}}
{"id":"enwiki-00000012-0010-0000","contents":"!PAUS3, Collaborations, Let's Go Somewhere Quiet\nThe first single from the THEE PAUSE produced album Let's Go Somewhere Quiet to benefit The Children's Brain Tumour Foundation featuring a remix of Lena Katina's track \"Never Forget\" was released on July 27, 2012, on Projecting Nothing Records. It also features an original unreleased track by THEE PAUSE.","metadata":{"title_span":[0,6],"section_span":[8,48],"content_span":[49,354]}}
{"id":"enwiki-00000013-0000-0000","contents":"!Women Art Revolution\n! Women Art Revolution is a 2010 documentary film directed by Lynn Hershman Leeson and distributed by Zeitgeist Films. It tracks the feminist art movement over 40 years through interviews with artists, curators, critics, and historians.","metadata":{"title_span":[0,21],"section_span":[21,21],"content_span":[22,258]}}
{"id":"enwiki-00000013-0001-0000","contents":"!Women Art Revolution, Synopsis\n! Women Art Revolution is a documentary film, created by Lynn Hershman Leeson, to examine the under-recognized world of feminist art. Through interviews, documentary footage, and artworks, the film tracks the trajectory of feminist art. It begins at the start of the 1960s with antiwar and civil rights protests, it follows developments in feminist art through the 1970s.","metadata":{"title_span":[0,21],"section_span":[23,31],"content_span":[32,403]}}
{"id":"enwiki-00000013-0002-0000","contents":"!Women Art Revolution, Synopsis\nLynn Hershman Lesson interviewed artists, curators, critics, and historians for over 4 decades about their individual and group efforts to help women succeed in the art world and society by helping them overcome obstacles. There were over 40 individuals interviewed for the project. These interviews are done in a variety of places over time. The interviewees talk about their experiences in the art world facing obstacles because of their gender. Many of the artists discuss the works they made as a result.","metadata":{"title_span":[0,21],"section_span":[23,31],"content_span":[32,540]}}
{"id":"enwiki-00000013-0002-0001","contents":"!Women Art Revolution, Synopsis\nThe movie begins with a scene at the Whitney Museum of American Art, where Hershman asks people to name 3 women artists; very few can name more than Frida Khalo. Hershman calls the film the, \"remains of an insistent history that refuses to wait any longer to be told.\" She says the events of the day led her to feel an, \"urgency to capture that moment\" and shoot whenever, wherever with a borrowed camera.","metadata":{"title_span":[0,21],"section_span":[23,31],"content_span":[32,437]}}
{"id":"enwiki-00000013-0003-0000","contents":"!Women Art Revolution, Synopsis\nThe film gets its name from Women Artists in Revolution (WAR), which formed in the 1960s as a coalition to raise awareness about the unique obstacles faced by female artists. Many of the issues started at a fundamental level, Rachel Rosenthal states in the movie, with the women artists not getting recognition in the study of art history and books. The interviewees all talk about how male-dominated the art world was, sharing their personal stories. The work these feminist artists were creating at the time were very different from works shown or talked about at the time.","metadata":{"title_span":[0,21],"section_span":[23,31],"content_span":[32,607]}}
{"id":"enwiki-00000013-0004-0000","contents":"!Women Art Revolution, Synopsis\nThe film overlays historical events with feminist art events, which were somewhat spurred on by these political events such as the Vietnam War, Black Panthers, Civil Rights Movement, Women's Liberation, and Free Speech Movement. She labels the 1968 Miss America Pageant as the moment when art and politics fused, culminating in a weeklong protest of art events.","metadata":{"title_span":[0,21],"section_span":[23,31],"content_span":[32,393]}}
{"id":"enwiki-00000013-0005-0000","contents":"!Women Art Revolution, Synopsis\nThe film mentions that minimalism was the popular art style of the time. Meant to be devoid of politics, this movement didn't match up with what was happening socially and politically. The feminist art movement worked to recognize contemporary political movements and social issues, creating a platform for awareness of these events.","metadata":{"title_span":[0,21],"section_span":[23,31],"content_span":[32,365]}}
{"id":"enwiki-00000013-0006-0000","contents":"!Women Art Revolution, Release\nThe film debuted at the Toronto International Film Festival (TIFF) 2010 as part of the Real to Reel category.","metadata":{"title_span":[0,21],"section_span":[23,30],"content_span":[31,140]}}
{"id":"enwiki-00000013-0007-0000","contents":"!Women Art Revolution, Release\n! Women Art Revolution played at New York's IFC Center beginning June 1, 2011, before opening around the country.","metadata":{"title_span":[0,21],"section_span":[23,30],"content_span":[31,144]}}
{"id":"enwiki-00000013-0008-0000","contents":"!Women Art Revolution, Digital archive\nIn the film, Hershman states that the filming process, \"has accumulated (roughly) 12,428 minutes of footage\", and ! W.A.R. shows only 83 minutes, leaving 12,343 minutes of footage out. A digital archive was created to contain the two decades of Hershmann Leeson's interviews that went into creating this film and is available through the Stanford University Libraries collection, !W.A.R. Voices of a Movement. According to the collection website, Hershmann Leeson desired this repository to \"be shared with as wide an audience as possible\".","metadata":{"title_span":[0,21],"section_span":[23,38],"content_span":[39,579]}}
{"id":"enwiki-00000013-0009-0000","contents":"!Women Art Revolution, Reception\nBarry Keith Grant praises the film in his Film International piece, \"Leeson's film is a like a patchwork quilt of disparate footage, but in the end it all comes together to become an important feminist work. The film could well serve as required viewing for art and film students today.\"","metadata":{"title_span":[0,21],"section_span":[23,32],"content_span":[33,320]}}
{"id":"enwiki-00000013-0010-0000","contents":"!Women Art Revolution, Reception\nReviewer Ellen Druda says, \"This powerful film will ignite even the tiniest spark of feminism in any woman's heart. Not only art lovers will come away with a deeper understanding of the movement and an appreciation for those who stood up and paved the way.\"","metadata":{"title_span":[0,21],"section_span":[23,32],"content_span":[33,290]}}
{"id":"enwiki-00000013-0011-0000","contents":"!Women Art Revolution, Reception\nRichard Knight for the Windy City Times has a more critical view of the film, explaining, \"Hershman Leeson succeeds in her goal to expose and pique the interest of the viewer to the radical feminist artists who used activist tactics to get their work shown, demanding parity with their male counterparts.","metadata":{"title_span":[0,21],"section_span":[23,32],"content_span":[33,337]}}
{"id":"enwiki-00000013-0011-0001","contents":"!Women Art Revolution, Reception\nHowever, by the time queer film historian B. Ruby Rich starts talking about how the lesbian artists didn't want to identify as artists because that label was considered bourgeois by their female counterparts, the movie has taken on an exclusionary air of its own – just like those 'womyn only' coffeehouses that existed 'back in the day'. So, while the film undercuts some of its own arguments by veering too strongly into the very separatist direction it decries – and annoyingly overlooks the artist's feminist forebears (like O'Keeffe, Nevelson and Kahlo, for example) – !Women Art Revolution does offer plenty of food for thought for everyone.\"","metadata":{"title_span":[0,21],"section_span":[23,32],"content_span":[33,681]}}
{"id":"enwiki-00000013-0012-0000","contents":"!Women Art Revolution, Reception\nElisabeth Subrin states that, \"Fusing history with memoir, Lynn Hershman Leeson enlists multiple visual strategies to produce an elegantly layered visual and sonic web of politics and powerful emotion.\"","metadata":{"title_span":[0,21],"section_span":[23,32],"content_span":[33,235]}}
{"id":"enwiki-00000014-0000-0000","contents":"!Wowow!\n!Wowow! is a collective in Peckham, London. Otherwise known as The Children of !Wowow!, they are a group of artists, fashion designers, writers and musicians, who have promoted numerous art events and parties in London and Berlin.","metadata":{"title_span":[0,7],"section_span":[7,7],"content_span":[8,238]}}
